#################################
# ジャンク
#
#################################
= 特に(ほんとに)どうでも良い話
== ソフトウェアの起源
初めてソフトウェアという言葉が使用されたのは1800年代半ばである. 
場所はアメリカの片田舎, ある役所が「正しいソフトウェアの出し方」
という通知で使われたのが最初である. この時代, 今日的な意味の
ソフトウェアなどあるはずもない. それではこの「ソフトウェア」は
何を指しているのであろうか. この「ソフトウェア」はあなたの家の
台所のどこかにあるはずの, そう, あれ...「なまごみ」である. 
ハードウェアに対して腐りやすい生ゴミをソフトウェアと言ったのである.
ともあれ(?), ソフトウェアとは腐りやすいゴミだそうだ.   

=== 出処
* 竹内郁雄: 初めての人のためのLISP [増補改訂版], 2010, 翔泳社, p6

== SLコマンド
Linuxで一番使用頻度の高いコマンドであろう'ls'. 
よく'sl'なんて勢いで打っちゃってませんか? 
SLコマンドはそんなせっかちな人のためのコマンドです. 
とにかく蒸気機関車の走る姿を見て癒されてください. 

=== インストール
OS: Ubuntu
 # apt-get install sl

=== 実行
 $ sl
蒸気機関車が走ります. 

 $ sl -l
蒸気機関車が長くなります. 

 $ sl -a
乗客が助けを求めます. 

 $ sl -F
まさに銀河鉄道

実際の様子は各自で試して確認してください. 

=== やってはいけないこと(?) 
 $ alias ls="sl"

(人はダメと言われたことほどやりたくなる生き物ですよね!)

=== おまけ
* ((<リアルslコマンド|URL:http://www.youtube.com/watch?v=Cb70kMCsBV0>))

=== 出処
